app/Controllers/Dashboard.php

SELECT *
FROM `order_items`
WHERE `order_id` = '3'
SELECT COUNT(*) AS `numrows`
FROM `menus`
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
SELECT *
FROM `menus`
ORDER BY `id` DESC
 LIMIT 5
---
    public function index()
    {
        $orders = $this->orderModel->getOrdersWithUser();

        foreach ($orders as &$order) {
            $order['items'] = $this->orderItemModel->where('order_id', $order['id'])->findAll();
        }

        return view('dashboard/index', [
            'title'          => 'Dashboard Admin | RM. Ibu Iroh',
            'totalMenu'      => $this->menuModel->countAllResults(),
            'totalOrders'    => $this->orderModel->countAllResults(),
            'pendingOrders'  => $this->orderModel->where('status', 'pending')->countAllResults(),
            'totalCustomers' => $this->userModel->where('role', 'user')->countAllResults(),
            'menus'          => $this->menuModel->orderBy('id', 'DESC')->findAll(5),

SELECT *
FROM `menus`
ORDER BY `id` DESC
---
    public function menus()
    {
        return view('dashboard/menus', [
            'title' => 'Manajemen Menu | RM. Ibu Iroh',
            'menus' => $this->menuModel->orderBy('id', 'DESC')->findAll(),

SELECT *
FROM `menus`
WHERE `menus`.`id` = 1
DELETE FROM `menus`
WHERE `id` IN (1)
---
    public function deleteMenu($id)
    {
        $menu = $this->menuModel->find((int) $id);

        if ($menu && ! empty($menu['gambar'])) {
            $path = FCPATH . 'uploads/menu/' . $menu['gambar'];
            if (is_file($path)) {
                unlink($path);
            }
        }

        $this->menuModel->delete((int) $id);

SELECT *
FROM `order_items`
WHERE `order_id` = '3'
---
    public function orders()
    {
        $orders = $this->orderModel->getOrdersWithUser();

        foreach ($orders as &$order) {
            $order['items'] = $this->orderItemModel->where('order_id', $order['id'])->findAll();

UPDATE `orders` SET `status` = 'pending', `payment_status` = 'paid', `updated_at` = '2026-06-14 18:57:10'
WHERE `orders`.`id` IN (3)
---
    public function updateOrderStatus($id)
    {
        $status = $this->request->getPost('status');
        $paymentStatus = $this->request->getPost('payment_status');

        if (! in_array($status, ['pending', 'processing', 'ready', 'completed', 'cancelled'], true)) {
            return redirect()->back()->with('error', 'Status pesanan tidak valid.');
        }

        if (! in_array($paymentStatus, ['unpaid', 'paid'], true)) {
            return redirect()->back()->with('error', 'Status pembayaran tidak valid.');
        }

        $this->orderModel->update((int) $id, [
            'status'         => $status,
            'payment_status' => $paymentStatus,
        ]);

SELECT *
FROM `users`
WHERE `role` = 'user'
ORDER BY `id` DESC
---
    public function customers()
    {
        return view('dashboard/customers', [
            'title'     => 'Data Pelanggan | RM. Ibu Iroh',
            'customers' => $this->userModel->where('role', 'user')->orderBy('id', 'DESC')->findAll(),