app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `menus`
WHERE `kategori` = 'Makanan'
---
    private function countMenuByCategory(string $category): int
    {
        return (new MenuModel())->where('kategori', $category)->countAllResults();

SELECT *
FROM `users`
WHERE `role` = 'admin'
AND `users`.`id` = 1
---
    private function getCurrentAdmin(): ?array
    {
        $userId = (int) session()->get('user_id');

        if ($userId <= 0) {
            $username = session()->get('username') ?: 'admin';
            return $this->userModel->where('username', $username)->where('role', 'admin')->first();
        }

        return $this->userModel->where('role', 'admin')->find($userId);