app/Controllers/Home.php

    private function getActiveMenus(): array
    {
        return $this->menuModel
            ->where('is_active', 1)
            ->orderBy('kategori', 'ASC')
            ->orderBy('favorit', 'DESC')
            ->orderBy('nama', 'ASC')
            ->findAll();
---
SELECT *
FROM `menus`
WHERE `is_active` = 1
ORDER BY `kategori` ASC, `favorit` DESC, `nama` ASC