app/Models/OrderModel.php

    public function getOrdersWithUser(?int $userId = null): array
    {
        $builder = $this->select('orders.*, users.username, users.nama_lengkap')
            ->join('users', 'users.id = orders.user_id', 'left')
            ->orderBy('orders.created_at', 'DESC');

        if ($userId !== null) {
            $builder->where('orders.user_id', $userId);
        }

        return $builder->findAll();
---
SELECT `orders`.*, `users`.`username`, `users`.`nama_lengkap`
FROM `orders`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`
ORDER BY `orders`.`created_at` DESC